<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>
<meta name="google-site-verification" content="y2Tsc6YVry1rlBn1ZDPfjMZCuFOWX_Tpchp1Yfd6nWk" />
<meta name="baidu-site-verification" content="PzhPbVlRVc" />


<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="设计模式," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="7&amp;#x79CD;&amp;#x5E38;&amp;#x7528;&amp;#x7684;&amp;#x9762;&amp;#x5411;&amp;#x5BF9;&amp;#x8C61;&amp;#x8BBE;&amp;#x8BA1;&amp;#x539F;&amp;#x5219;1&amp;#xFF1A;&amp;#x5355;&amp;#x4E00;&amp;#x804C;&amp;#x8D23;&amp;#x539F;&amp;#x5219; &amp;#x4E00;&amp;#x4E2A;&amp;#x7C7B;&amp;#x53EA;&amp;#x8D1F;&amp;#x8D">
<meta property="og:type" content="article">
<meta property="og:title" content="《设计模式的艺术:软件开发人员内功修炼之道》简记">
<meta property="og:url" content="http://tedhacker.top/2016/09/13/《设计模式的艺术-软件开发人员内功修炼之道》简记/index.html">
<meta property="og:site_name" content="Ted's Blog">
<meta property="og:description" content="7&amp;#x79CD;&amp;#x5E38;&amp;#x7528;&amp;#x7684;&amp;#x9762;&amp;#x5411;&amp;#x5BF9;&amp;#x8C61;&amp;#x8BBE;&amp;#x8BA1;&amp;#x539F;&amp;#x5219;1&amp;#xFF1A;&amp;#x5355;&amp;#x4E00;&amp;#x804C;&amp;#x8D23;&amp;#x539F;&amp;#x5219; &amp;#x4E00;&amp;#x4E2A;&amp;#x7C7B;&amp;#x53EA;&amp;#x8D1F;&amp;#x8D">
<meta property="og:updated_time" content="2016-09-13T02:01:30.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《设计模式的艺术:软件开发人员内功修炼之道》简记">
<meta name="twitter:description" content="7&amp;#x79CD;&amp;#x5E38;&amp;#x7528;&amp;#x7684;&amp;#x9762;&amp;#x5411;&amp;#x5BF9;&amp;#x8C61;&amp;#x8BBE;&amp;#x8BA1;&amp;#x539F;&amp;#x5219;1&amp;#xFF1A;&amp;#x5355;&amp;#x4E00;&amp;#x804C;&amp;#x8D23;&amp;#x539F;&amp;#x5219; &amp;#x4E00;&amp;#x4E2A;&amp;#x7C7B;&amp;#x53EA;&amp;#x8D1F;&amp;#x8D">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"right","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://tedhacker.top/2016/09/13/《设计模式的艺术-软件开发人员内功修炼之道》简记/"/>

  <title> 《设计模式的艺术:软件开发人员内功修炼之道》简记 | Ted's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-right page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Ted's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-guestbook">
          <a href="/guestbook" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-book"></i> <br />
            
            留言
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                《设计模式的艺术:软件开发人员内功修炼之道》简记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-09-13T09:54:44+08:00" content="2016-09-13">
              2016-09-13
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/读书笔记/" itemprop="url" rel="index">
                    <span itemprop="name">读书笔记</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/09/13/《设计模式的艺术-软件开发人员内功修炼之道》简记/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/09/13/《设计模式的艺术-软件开发人员内功修炼之道》简记/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2016/09/13/《设计模式的艺术-软件开发人员内功修炼之道》简记/" class="leancloud_visitors" data-flag-title="《设计模式的艺术:软件开发人员内功修炼之道》简记">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h3 id="7&#x79CD;&#x5E38;&#x7528;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x539F;&#x5219;"><a href="#7&#x79CD;&#x5E38;&#x7528;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x539F;&#x5219;" class="headerlink" title="7&#x79CD;&#x5E38;&#x7528;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x539F;&#x5219;"></a>7&#x79CD;&#x5E38;&#x7528;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x539F;&#x5219;</h3><p>1&#xFF1A;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219; &#x4E00;&#x4E2A;&#x7C7B;&#x53EA;&#x8D1F;&#x8D23;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x9886;&#x57DF;&#x4E2D;&#x7684;&#x76F8;&#x5E94;&#x804C;&#x8D23;<br>2&#xFF1A;&#x5F00;&#x95ED;&#x539F;&#x5219; &#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x5E94;&#x5BF9;&#x6269;&#x5C55;&#x5F00;&#x653E;&#xFF0C;&#x800C;&#x5BF9;&#x4FEE;&#x6539;&#x5173;&#x95ED;<br>3&#xFF1A;&#x91CC;&#x6C0F;&#x4EE3;&#x6362;&#x539F;&#x5219; &#x6240;&#x6709;&#x5F15;&#x7528;&#x57FA;&#x7C7B;&#x5BF9;&#x8C61;&#x7684;&#x5730;&#x65B9;&#x80FD;&#x591F;&#x900F;&#x660E;&#x5730;&#x4F7F;&#x7528;&#x5176;&#x5B50;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;<br>4&#xFF1A;&#x4F9D;&#x8D56;&#x5012;&#x8F6C;&#x539F;&#x5219; &#x62BD;&#x8C61;&#x4E0D;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x4E8E;&#x7EC6;&#x8282;&#xFF0C;&#x7EC6;&#x8282;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x4E8E;&#x62BD;&#x8C61;<br>5&#xFF1A;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219; &#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x4E13;&#x95E8;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x4E0D;&#x4F7F;&#x7528;&#x5355;&#x4E00;&#x7684;&#x603B;&#x63A5;&#x53E3;<br>6&#xFF1A;&#x5408;&#x6210;&#x590D;&#x7528;&#x539F;&#x5219; &#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x7EC4;&#x5408;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7EE7;&#x627F;&#x6765;&#x8FBE;&#x5230;&#x590D;&#x7528;&#x7684;&#x76EE;&#x7684;<br>7&#xFF1A;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219; &#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x5E94;&#x5F53;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x5730;&#x4E0E;&#x5176;&#x4ED6;&#x5B9E;&#x4F53;&#x53D1;&#x751F;&#x76F8;&#x4E92;&#x4F5C;&#x7528;</p>
<p>1&#xFF1A;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#xFF08;Single Responsibility Rrinciple&#xFF0C; SRP&#xFF09;&#xFF1A;&#x4E00;&#x4E2A;&#x7C7B;&#x53EA;&#x8D1F;&#x8D23;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x9886;&#x57DF;&#x4E2D;&#x7684;&#x76F8;&#x5E94;&#x804C;&#x8D23;&#x3002;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;&#x5C31;&#x4E00;&#x4E2A;&#x7C7B;&#x800C;&#x8A00;&#xFF0C;&#x5E94;&#x8BE5;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5F15;&#x8D77;&#x5B83;&#x53D8;&#x5316;&#x7684;&#x539F;&#x56E0;&#x3002;<br>2&#xFF1A;&#x5F00;&#x95ED;&#x539F;&#x5219;&#xFF08;Open-Closed Principle&#xFF0C;OCP&#xFF09;&#xFF1A;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x5E94;&#x5F53;&#x5BF9;&#x6269;&#x5C55;&#x5F00;&#x653E;&#xFF0C;&#x5BF9;&#x4FEE;&#x6539;&#x5173;&#x95ED;&#x3002;&#x5373;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x5E94;&#x5C3D;&#x91CF;&#x5728;&#x4E0D;&#x4FEE;&#x6539;&#x539F;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#x3002;<br>3&#xFF1A;&#x91CC;&#x6C0F;&#x4EE3;&#x6362;&#x539F;&#x5219;&#xFF08;Liskov Subsititution Principle&#xFF0C;LSP&#xFF09;&#xFF1A;&#x6240;&#x6709;&#x5F15;&#x7528;&#x57FA;&#x7C7B;&#xFF08;&#x7236;&#x7C7B;&#xFF09;&#x7684;&#x5730;&#x65B9;&#x5FC5;&#x987B;&#x80FD;&#x900F;&#x660E;&#x5730;&#x4F7F;&#x7528;&#x5176;&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#x3002;<br>4&#xFF1A;&#x4F9D;&#x8D56;&#x5012;&#x8F6C;&#x539F;&#x5219;&#xFF08;Dependency Inversion Principle&#xFF0C;DIP&#xFF09;&#xFF1A;&#x62BD;&#x8C61;&#x4E0D;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x4E8E;&#x7EC6;&#x8282;&#xFF0C;&#x7EC6;&#x8282;&#x5E94;&#x5F53;&#x4F9D;&#x8D56;&#x4E8E;&#x62BD;&#x8C61;&#x3002;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x8981;&#x9488;&#x5BF9;&#x63A5;&#x53E3;&#x7F16;&#x7A0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9488;&#x5BF9;&#x5B9E;&#x73B0;&#x7F16;&#x7A0B;&#x3002;<br>     &#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x662F;&#x6307;&#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x8981;&#x4E0E;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x53D1;&#x751F;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x62BD;&#x8C61;&#x6765;&#x6CE8;&#x5165;&#x6240;&#x4F9D;&#x8D56;&#x7684;&#x5BF9;&#x8C61;&#x3002;<br>     &#x5E38;&#x7528;&#x7684;&#x6CE8;&#x5165;&#x65B9;&#x5F0F;&#x6709;3&#x79CD;&#xFF1A;&#x6784;&#x9020;&#x6CE8;&#x5165;&#xFF0C;&#x8BBE;&#x503C;&#x6CE8;&#x5165;&#x548C;&#x63A5;&#x53E3;&#x6CE8;&#x5165;&#x3002;<br>5&#xFF1A;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#xFF08;Interface Segregation Principle&#xFF0C;ISP&#xFF09;&#xFF1A;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x4E13;&#x95E8;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x4E0D;&#x4F7F;&#x7528;&#x5355;&#x4E00;&#x7684;&#x603B;&#x63A5;&#x53E3;&#xFF0C;&#x5373;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x90A3;&#x4E9B;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x63A5;&#x53E3;&#x3002;<br>6&#xFF1A;&#x5408;&#x6210;&#x590D;&#x7528;&#x539F;&#x5219;&#xFF08;Composite Reuse Rrinciple&#xFF0C;CRP&#xFF09;&#xFF1A;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x7EC4;&#x5408;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7EE7;&#x627F;&#x6765;&#x8FBE;&#x5230;&#x590D;&#x7528;&#x7684;&#x76EE;&#x7684;&#x3002;<br>7&#xFF1A;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#xFF08;Law of Demeter&#xFF0C;LoD&#xFF09;&#xFF1A;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x5E94;&#x5F53;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x5730;&#x4E0E;&#x5176;&#x4ED6;&#x5B9E;&#x4F53;&#x53D1;&#x751F;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x7C7B;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;&#x4F7F;&#x7528;&#x7EE7;&#x627F;&#x6539;&#x53D8;&#x88AB;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x7C7B;&#x3002;&#x800C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;&#x5C06;&#x5B9E;&#x4F8B;&#x5316;&#x59D4;&#x6258;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;</p>
<h3 id="&#x521B;&#x5EFA;&#x7684;&#x827A;&#x672F;&#x2013;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;"><a href="#&#x521B;&#x5EFA;&#x7684;&#x827A;&#x672F;&#x2013;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;" class="headerlink" title="&#x521B;&#x5EFA;&#x7684;&#x827A;&#x672F;&#x2013;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;"></a>&#x521B;&#x5EFA;&#x7684;&#x827A;&#x672F;&#x2013;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;</h3><p>&#x6A21;&#x5F0F;&#x540D;&#x79F0;&#x548C;&#x5B9A;&#x4E49;&#xFF1A;<br><strong>&#x5355;&#x4F8B;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x786E;&#x4FDD;&#x67D0;&#x4E00;&#x4E2A;&#x7C7B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x800C;&#x4E14;&#x81EA;&#x884C;&#x5B9E;&#x4F8B;&#x5316;&#x5E76;&#x5411;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x8FD9;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;<br><strong>&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5DE5;&#x5382;&#x7C7B;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x53C2;&#x6570;&#x7684;&#x4E0D;&#x540C;&#x8FD4;&#x56DE;&#x4E0D;&#x540C;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x88AB;&#x521B;&#x5EFA;&#x7684;&#x5B9E;&#x4F8B;&#x901A;&#x5E38;&#x90FD;&#x5177;&#x6709;&#x5171;&#x540C;&#x7684;&#x7236;&#x7C7B;&#x3002;<br><strong>&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8BA9;&#x5B50;&#x7C7B;&#x51B3;&#x5B9A;&#x5C06;&#x54EA;&#x4E00;&#x4E2A;&#x7C7B;&#x5B9E;&#x4F8B;&#x5316;&#x3002;<br><strong>&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x521B;&#x5EFA;&#x4E00;&#x7CFB;&#x5217;&#x76F8;&#x5173;&#x6216;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x65E0;&#x987B;&#x6307;&#x5B9A;&#x5B83;&#x4EEC;&#x5177;&#x4F53;&#x7684;&#x7C7B;&#x3002;<br><strong>&#x539F;&#x578B;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x4F7F;&#x7528;&#x539F;&#x578B;&#x5B9E;&#x4F8B;&#x6307;&#x5B9A;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x79CD;&#x7C7B;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x590D;&#x5236;&#x8FD9;&#x4E9B;&#x539F;&#x578B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x3002;<br><strong>&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#x7684;&#x6784;&#x5EFA;&#x4E0E;&#x5B83;&#x7684;&#x8868;&#x793A;&#x5206;&#x79BB;&#xFF0C;&#x4F7F;&#x5F97;&#x540C;&#x6837;&#x7684;&#x6784;&#x5EFA;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x793A;&#x3002;</p>
<h4 id="&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#xFF1A;"><a href="#&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#xFF1A;" class="headerlink" title="&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#xFF1A;"></a><strong>&#x5355;&#x4F8B;&#x6A21;&#x5F0F;</strong>&#xFF1A;</h4><p>&#x52A8;&#x673A;&#xFF1A;&#x786E;&#x4FDD;&#x5BF9;&#x8C61;&#x7684;&#x552F;&#x4E00;&#x6027;&#x3002;&#xFF08;&#x4F8B;&#x5982;&#xFF1A;Windows&#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#x5668;&#x3001;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#xFF09;<br>&#x5B9A;&#x4E49;&#xFF1A;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#xFF08;Singleton Pattern&#xFF09;&#xFF1A;&#x786E;&#x4FDD;&#x67D0;&#x4E00;&#x4E2A;&#x7C7B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x800C;&#x4E14;&#x81EA;&#x884C;&#x5B9E;&#x4F8B;&#x5316;&#x5E76;&#x5411;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x8FD9;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x79F0;&#x4E3A;&#x5355;&#x4F8B;&#x7C7B;&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x5168;&#x5C40;&#x8BBF;&#x95EE;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x79CD;<strong>&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;</strong>&#x3002;<br>&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x6709;3&#x4E2A;&#x8981;&#x70B9;&#xFF1A;&#xFF08;1&#xFF09;&#x67D0;&#x4E2A;&#x7C7B;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;&#xFF08;2&#xFF09;&#x5B83;&#x5FC5;&#x987B;&#x81EA;&#x884C;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;&#xFF08;3&#xFF09;&#x5B83;&#x5FC5;&#x987B;&#x81EA;&#x884C;&#x5411;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x8FD9;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;<br>Singleton&#xFF08;&#x5355;&#x4F8B;&#xFF09;&#xFF1A;&#x5728;&#x5355;&#x4F8B;&#x7C7B;&#x7684;&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x53EA;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x7684;GetInstance()&#x65B9;&#x6CD5;&#xFF0C;&#x8BA9;&#x5BA2;&#x6237;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5B83;&#x7684;&#x552F;&#x4E00;&#x5B9E;&#x4F8B;&#xFF1B;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x5728;&#x5916;&#x90E8;&#x5BF9;&#x5355;&#x4F8B;&#x7C7B;&#x5B9E;&#x4F8B;&#x5316;&#xFF0C;&#x5B83;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x53EF;&#x89C1;&#x6027;&#x4E3A;private&#xFF1B;&#x5728;&#x5355;&#x4F8B;&#x7C7B;&#x5185;&#x90E8;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;Singleton&#x7C7B;&#x578B;&#x7684;&#x9759;&#x6001;&#x5BF9;&#x8C61;&#xFF0C;&#x4F5C;&#x4E3A;&#x4F9B;&#x5916;&#x90E8;&#x5171;&#x4EAB;&#x8BBF;&#x95EE;&#x7684;&#x552F;&#x4E00;&#x5B9E;&#x4F8B;&#x3002;<br>&#x997F;&#x6C49;&#x5F0F;&#x5355;&#x4F8B;&#x7C7B;&#xFF1A;<br>class EagerSingleton{<br>   private static final EagerSingleton instance=new EagerSingleton();<br>   private EagerSingleton(){}<br>   public static EagerSingleton getInstance(){return instance};<br>}<br>&#x5F53;&#x7C7B;&#x88AB;&#x52A0;&#x8F7D;&#x65F6;&#xFF0C;&#x9759;&#x6001;&#x53D8;&#x91CF;instance&#x4F1A;&#x88AB;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x6B64;&#x65F6;&#x7C7B;&#x7684;&#x79C1;&#x6709;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x5B9E;&#x4F8B;&#x7C7B;&#x7684;&#x552F;&#x4E00;&#x5B9E;&#x4F8B;&#x5C06;&#x88AB;&#x521B;&#x5EFA;&#x3002;<br>&#x61D2;&#x6C49;&#x5F0F;&#x5355;&#x4F8B;&#x7C7B;&#xFF1A;<br>class LazySingleton{<br>   private static LazySingleton instance=null;<br>   private LazySingleton(){}<br>   synchronized public static LazySingleton getInstance(){<br>      if(instance==null){instance=new LazySingleton();}<br>      return instance;<br>   }<br>}<br>&#x61D2;&#x6C49;&#x5F0F;&#x5355;&#x4F8B;&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528;getInstance()&#x65B9;&#x6CD5;&#x65F6;&#x5B9E;&#x4F8B;&#x5316;&#xFF0C;&#x5728;&#x7C7B;&#x52A0;&#x8F7D;&#x65F6;&#x5E76;&#x4E0D;&#x81EA;&#x884C;&#x5B9E;&#x4F8B;&#x5316;&#xFF0C;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x53C8;&#x79F0;&#x4E3A;<strong>&#x5EF6;&#x8FDF;&#x52A0;&#x8F7D;&#x6280;&#x672F;</strong>&#xFF0C;&#x5373;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x518D;&#x52A0;&#x8F7D;&#x5B9E;&#x4F8B;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x8C03;&#x7528;getInstance()&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;synchronized&#x3002;<br>&#x4F7F;&#x7528;<strong>&#x53CC;&#x91CD;&#x68C0;&#x67E5;&#x9501;&#x5B9A;</strong>&#x4F18;&#x5316;&#x61D2;&#x6C49;&#x5F0F;&#x5355;&#x4F8B;&#x7C7B;&#xFF1A;<br>class LazySingleton{<br>   private volatile static LazySingleton instance=null;//&#x589E;&#x52A0;volatile&#x5173;&#x952E;&#x5B57;&#x786E;&#x4FDD;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x80FD;&#x591F;&#x6B63;&#x5E38;&#x5904;&#x7406;<br>   private LazySingleton(){}<br>   public static LazySingleton getInstance(){<br>      if(instance==null){//&#x7B2C;&#x4E00;&#x91CD;&#x5224;&#x65AD;<br>         synchronized(LazySingleton.class){//&#x9501;&#x5B9A;&#x4EE3;&#x7801;&#x5757;<br>            if(instance==null){instance=new LazySingleton();}//&#x7B2C;&#x4E8C;&#x91CD;&#x5224;&#x65AD;&#x53CA;&#x521B;&#x5EFA;&#x5355;&#x4F8B;&#x5B9E;&#x4F8B;<br>         }<br>      }<br>      return instance;<br>   }<br>}<br>&#x4E00;&#x79CD;&#x66F4;&#x597D;&#x7684;&#x5355;&#x4F8B;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;<br><strong>Initialization on Demand Holder(IoDH)</strong>class Singleton{<br>   private Singleton(){}<br>   private static class HolderClass{<br>      private final static Singleton instance=new Singleton();<br>   }<br>   public static Singleton getInstance(){return HolderClass.instance;}<br>}<br>&#x7531;&#x4E8E;&#x9759;&#x6001;&#x5355;&#x4F8B;&#x5BF9;&#x8C61;&#x6CA1;&#x6709;&#x4F5C;&#x4E3A;Singleton&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x76F4;&#x63A5;&#x5B9E;&#x4F8B;&#x5316;&#xFF0C;&#x56E0;&#x6B64;&#x7C7B;&#x52A0;&#x8F7D;&#x65F6;&#x4E0D;&#x4F1A;&#x5B9E;&#x4F8B;&#x5316;Singleton&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528;getInstance()&#x65F6;&#x5C06;&#x52A0;&#x8F7D;&#x5185;&#x90E8;&#x7C7B;HolderClass&#xFF0C;&#x5728;&#x8BE5;&#x5185;&#x90E8;&#x7C7B;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;static&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;instance&#xFF0C;&#x6B64;&#x65F6;&#x4F1A;&#x9996;&#x5148;&#x521D;&#x59CB;&#x5316;&#x8FD9;&#x4E2A;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF0C;&#x7531;Java&#x865A;&#x62DF;&#x673A;&#x6765;&#x4FDD;&#x8BC1;&#x5176;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x786E;&#x4FDD;&#x8BE5;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x53EA;&#x80FD;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x6B21;&#x3002;&#x7531;&#x4E8E;getInstance()&#x65B9;&#x6CD5;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7EBF;&#x7A0B;&#x9501;&#x5B9A;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x6027;&#x80FD;&#x4E0D;&#x80FD;&#x9020;&#x6210;&#x4EFB;&#x4F55;&#x5F71;&#x54CD;&#x3002;&#x5176;&#x7F3A;&#x70B9;&#x662F;&#x4E0E;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x672C;&#x8EAB;&#x7684;&#x7279;&#x6027;&#x76F8;&#x5173;&#x3002;<br>&#x603B;&#x7ED3;&#xFF08;P47&#xFF09;</p>
<h4 id="&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF1A;"><a href="#&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF1A;" class="headerlink" title="&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF1A;"></a><strong>&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;</strong>&#xFF1A;</h4><p>&#x96C6;&#x4E2D;&#x5F0F;&#x5DE5;&#x5382;&#x7684;&#x5B9E;&#x73B0;<br>&#x5B9A;&#x4E49;&#xFF1A;&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF08;Simple Factory Pattern&#xFF09;&#xFF1A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5DE5;&#x5382;&#x7C7B;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x53C2;&#x6570;&#x7684;&#x4E0D;&#x540C;&#x8FD4;&#x56DE;&#x4E0D;&#x540C;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x88AB;&#x521B;&#x5EFA;&#x7684;&#x5B9E;&#x4F8B;&#x901A;&#x5E38;&#x90FD;&#x5177;&#x6709;&#x5171;&#x540C;&#x7684;&#x7236;&#x7C7B;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x4E2D;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x5B9E;&#x4F8B;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x53C8;&#x88AB;&#x79F0;&#x4E3A;&#x9759;&#x6001;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x5C5E;&#x4E8E;<strong>&#x7C7B;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;</strong>&#x3002;<br>&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x7684;&#x8981;&#x70B9;&#x5728;&#x4E8E;&#xFF1A;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x4F60;&#x6240;&#x9700;&#x8981;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x65E0;&#x987B;&#x77E5;&#x9053;&#x5176;&#x521B;&#x5EFA;&#x7EC6;&#x8282;&#x3002;<br>&#x5728;&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;&#x56FE;&#x4E2D;&#x5305;&#x542B;&#x4EE5;&#x4E0B;3&#x4E2A;&#x89D2;&#x8272;&#xFF1A;<br>&#xFF08;1&#xFF09;Factory&#xFF08;&#x5DE5;&#x5382;&#x89D2;&#x8272;&#xFF09;&#xFF1A;&#x5373;&#x5DE5;&#x5382;&#x7C7B;&#xFF0C;&#x5B83;&#x662F;&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x8D1F;&#x8D23;&#x5B9E;&#x73B0;&#x521B;&#x5EFA;&#x6240;&#x6709;&#x4EA7;&#x54C1;&#x5B9E;&#x4F8B;&#x7684;&#x5185;&#x90E8;&#x903B;&#x8F91;&#xFF1B;&#x5DE5;&#x5382;&#x7C7B;&#x53EF;&#x4EE5;&#x88AB;&#x5916;&#x754C;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#xFF0C;&#x521B;&#x5EFA;&#x6240;&#x9700;&#x7684;&#x4EA7;&#x54C1;&#x5BF9;&#x8C61;&#xFF1B;&#x5728;&#x5DE5;&#x5382;&#x7C7B;&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x9759;&#x6001;&#x7684;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;factoryMethod()&#xFF0C;&#x5B83;&#x7684;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x4E3A;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x7C7B;&#x578B;Product&#x3002;<br>&#xFF08;2&#xFF09;Product&#xFF08;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x89D2;&#x8272;&#xFF09;&#xFF1A;&#x5B83;&#x662F;&#x5DE5;&#x5382;&#x7C7B;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x7684;&#x7236;&#x7C7B;&#xFF0C;&#x5C01;&#x88C5;&#x4E86;&#x5404;&#x79CD;&#x4EA7;&#x54C1;&#x5BF9;&#x8C61;&#x7684;&#x516C;&#x6709;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x7684;&#x5F15;&#x5165;&#x5C06;&#x63D0;&#x4F9B;&#x7CFB;&#x7EDF;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x4F7F;&#x5F97;&#x5728;&#x5DE5;&#x5382;&#x7C7B;&#x4E2D;&#x53EA;&#x9700;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x521B;&#x5EFA;&#x7684;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x5176;&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#x3002;<br>&#xFF08;3&#xFF09;ConcreteProduct&#xFF08;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x89D2;&#x8272;&#xFF09;&#xFF1A;&#x5B83;&#x662F;&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x7684;&#x521B;&#x5EFA;&#x76EE;&#x6807;&#xFF0C;&#x6240;&#x6709;&#x88AB;&#x521B;&#x5EFA;&#x7684;&#x89D2;&#x8272;&#x90FD;&#x5145;&#x5F53;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#x7684;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x89D2;&#x8272;&#x90FD;&#x7EE7;&#x627F;&#x4E86;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x89D2;&#x8272;&#xFF0C;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x5728;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x3002;<br>&#x5728;&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x8FC7;&#x5DE5;&#x5382;&#x7C7B;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x800C;&#x65E0;&#x987B;&#x76F4;&#x63A5;&#x4F7F;&#x7528;new&#x5173;&#x952E;&#x5B57;&#x6765;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x3002;<br>&#x5178;&#x578B;&#x7684;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x7C7B;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;<br>abstract class Product{<br>   // &#x6240;&#x6709;&#x4EA7;&#x54C1;&#x7C7B;&#x7684;&#x516C;&#x5171;&#x4E1A;&#x52A1;&#x65B9;&#x6CD5;<br>   public void methodSame(){<br>        //&#x516C;&#x5171;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;<br>   }<br>   // &#x58F0;&#x660E;&#x62BD;&#x8C61;&#x4E1A;&#x52A1;&#x65B9;&#x6CD5;<br>   public abstract void methodDiff();<br>}<br>&#x5178;&#x578B;&#x7684;&#x5DE5;&#x5382;&#x7C7B;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;<br>class Factory{<br>   // &#x9759;&#x6001;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;<br>   public static Product getProduct(String arg){<br>      Product product=null;<br>      if(arg.equalsIgnoreCase(&#x2018;A&#x2019;)){product=new ConcreteProductA();}<br>      else  if(arg.equalsIgnoreCase(&#x2018;B&#x2019;)){product=new ConcreteProductB();}<br>      &#x2026;&#x2026;<br>      return product;<br>   }<br>}<br>&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x4E0E;&#x9002;&#x7528;&#x5BF9;&#x8C61;<br>&#x4E0E;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x76F8;&#x5173;&#x7684;&#x804C;&#x8D23;&#x901A;&#x5E38;&#x6709;3&#x7C7B;&#xFF1A;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x6240;&#x5177;&#x6709;&#x7684;&#x804C;&#x8D23;&#x3001;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x804C;&#x8D23;&#x548C;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x7684;&#x804C;&#x8D23;&#x3002;<br>&#x5728;Java&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;<br>&#xFF08;1&#xFF09;&#x4F7F;&#x7528;new&#x5173;&#x952E;&#x5B57;&#x76F4;&#x63A5;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x3002;<br>&#xFF08;2&#xFF09;&#x901A;&#x8FC7;&#x53CD;&#x5C04;&#x673A;&#x5236;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x3002;<br>&#xFF08;3&#xFF09;&#x901A;&#x8FC7;clone()&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x3002;<br>&#xFF08;4&#xFF09;&#x901A;&#x8FC7;&#x5DE5;&#x5382;&#x7C7B;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x3002;<br>&#x6240;&#x6709;&#x7684;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x90FD;&#x5F3A;&#x8C03;&#x4E00;&#x70B9;&#xFF1A;&#x4E24;&#x4E2A;&#x7C7B;A&#x548C;B&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5E94;&#x8BE5;<strong>&#x4EC5;&#x4EC5;&#x662F;A&#x521B;&#x5EFA;B&#x6216;&#x662F;A&#x4F7F;&#x7528;</strong>B,&#x800C;&#x4E0D;&#x80FD;&#x4E24;&#x79CD;&#x5173;&#x7CFB;&#x90FD;&#x6709;&#x3002;<br>&#x603B;&#x7ED3;&#xFF08;P59&#xFF09;</p>
<h4 id="&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;"><a href="#&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;" class="headerlink" title="&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;"></a><strong>&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;</strong></h4><p>&#x591A;&#x6001;&#x5DE5;&#x5382;&#x7684;&#x5B9E;&#x73B0;<br>&#x52A8;&#x673A;&#xFF1A;<br>&#xFF08;1&#xFF09;&#x5DE5;&#x5382;&#x7C7B;&#x8FC7;&#x4E8E;&#x5E9E;&#x5927;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x5927;&#x91CF;&#x7684;if&#x2026;else&#x2026;&#x4EE3;&#x7801;&#xFF0C;&#x5BFC;&#x81F4;&#x7EF4;&#x62A4;&#x548C;&#x6D4B;&#x8BD5;&#x96BE;&#x5EA6;&#x589E;&#x5927;&#x3002;<br>&#xFF08;2&#xFF09;&#x7CFB;&#x7EDF;&#x6269;&#x5C55;&#x4E0D;&#x7075;&#x6D3B;&#xFF0C;&#x5982;&#x679C;&#x589E;&#x52A0;&#x65B0;&#x7C7B;&#x578B;&#x7684;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x5668;&#xFF0C;&#x5FC5;&#x987B;&#x4FEE;&#x6539;&#x9759;&#x6001;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x8FDD;&#x53CD;&#x4E86;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x3002;<br>&#x5B9A;&#x4E49;&#xFF1A;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#xFF08;Factory Method Pattern&#xFF09;&#xFF1A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8BA9;&#x5B50;&#x7C7B;&#x51B3;&#x5B9A;&#x5C06;&#x54EA;&#x4E00;&#x4E2A;&#x7C7B;&#x5B9E;&#x4F8B;&#x5316;&#x3002;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x8BA9;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x5316;&#x5EF6;&#x8FDF;&#x5230;&#x5176;&#x5B50;&#x7C7B;&#x3002;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x53C8;&#x7B80;&#x79F0;&#x4E3A;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF0C;&#x53C8;&#x53EF;&#x79F0;&#x4E3A;&#x865A;&#x62DF;&#x6784;&#x9020;&#x5668;&#x6A21;&#x5F0F;&#x6216;&#x591A;&#x6001;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x3002;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x79CD;<strong>&#x7C7B;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;</strong>&#x3002;<br>&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x63A5;&#x53E3;&#x6765;&#x58F0;&#x660E;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x7531;&#x5176;&#x5B50;&#x7C7B;&#x6765;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#xFF0C;&#x521B;&#x5EFA;&#x5177;&#x4F53;&#x7684;&#x4EA7;&#x54C1;&#x5BF9;&#x8C61;&#x3002;<br>&#x5728;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;&#x56FE;&#x4E2D;&#x5305;&#x542B;&#x4EE5;&#x4E0B;4&#x4E2A;&#x89D2;&#x8272;&#xFF1A;<br>&#xFF08;1&#xFF09;Product&#xFF08;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#xFF09;&#xFF1A;&#x5B83;&#x662F;&#x5B9A;&#x4E49;&#x4EA7;&#x54C1;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x662F;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x6240;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x8D85;&#x7C7B;&#x578B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4EA7;&#x54C1;&#x5BF9;&#x8C61;&#x7684;&#x516C;&#x5171;&#x7236;&#x7C7B;&#x3002;<br>&#xFF08;2&#xFF09;ConcreteProduct&#xFF08;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#xFF09;&#xFF1A;&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x63A5;&#x53E3;&#xFF0C;&#x67D0;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x7531;&#x4E13;&#x95E8;&#x7684;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#x521B;&#x5EFA;&#xFF0C;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#x548C;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x4E4B;&#x95F4;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x3002;<br>&#xFF08;3&#xFF09;Factory&#xFF08;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#xFF09;&#xFF1A;&#x5728;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x7C7B;&#x4E2D;&#xFF0C;&#x58F0;&#x660E;&#x4E86;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x3002;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x662F;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x6240;&#x6709;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x5DE5;&#x5382;&#x7C7B;&#x90FD;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x8BE5;&#x63A5;&#x53E3;&#x3002;<br>&#xFF08;4&#xFF09;ConcreteFactory&#xFF08;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#xFF09;&#xFF1A;&#x5B83;&#x662F;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x7C7B;&#x7684;&#x5B50;&#x7C7B;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x53EF;&#x7531;&#x5BA2;&#x6237;&#x7AEF;&#x8C03;&#x7528;&#xFF0C;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x3002;<br><strong>Java&#x53CD;&#x5C04;&#xFF08;Java Reflection&#xFF09;</strong>&#x662F;&#x6307;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x83B7;&#x53D6;&#x5DF2;&#x77E5;&#x540D;&#x79F0;&#x7684;&#x7C7B;&#x6216;&#x5DF2;&#x6709;&#x5BF9;&#x8C61;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x7684;&#x4E00;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x5305;&#x62EC;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x3001;&#x5C5E;&#x6027;&#x3001;&#x7236;&#x7C7B;&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x5B9E;&#x4F8B;&#x7684;&#x521B;&#x5EFA;&#x548C;&#x5B9E;&#x4F8B;&#x7C7B;&#x578B;&#x7684;&#x5224;&#x65AD;&#x7B49;&#x3002;&#x5728;&#x53CD;&#x5C04;&#x4E2D;&#x4F7F;&#x7528;&#x6700;&#x591A;&#x7684;&#x7C7B;&#x662F;Class&#x3002;Class&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x8868;&#x793A;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;Java&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x7C7B;&#x548C;&#x63A5;&#x53E3;&#xFF0C;&#x5176;forName(String className)&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x4E0E;&#x5E26;&#x6709;&#x7ED9;&#x5B9A;&#x5B57;&#x7B26;&#x4E32;&#x540D;&#x7684;&#x7C7B;&#x6216;&#x63A5;&#x53E3;&#x76F8;&#x5173;&#x8054;&#x7684;Class&#x5BF9;&#x8C61;&#xFF0C;&#x518D;&#x901A;&#x8FC7;Class&#x5BF9;&#x8C61;&#x7684;newInstance()&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x6B64;&#x5BF9;&#x8C61;&#x6240;&#x8868;&#x793A;&#x7684;&#x7C7B;&#x7684;&#x4E00;&#x4E2A;&#x65B0;&#x5B9E;&#x4F8B;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7C7B;&#x540D;&#x5B57;&#x7B26;&#x4E32;&#x5F97;&#x5230;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x3002;<br>java.lang.reflect&#x5305;&#x5C01;&#x88C5;&#x4E86;&#x5176;&#x4ED6;&#x4E0E;&#x53CD;&#x5C04;&#x76F8;&#x5173;&#x7684;&#x7C7B;&#x3002;<br>&#x603B;&#x7ED3;&#xFF08;P72&#xFF09;</p>
<h4 id="&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;"><a href="#&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;" class="headerlink" title="&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;"></a><strong>&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;</strong></h4><p>&#x4EA7;&#x54C1;&#x65CF;&#x7684;&#x521B;&#x5EFA;<br>&#x6982;&#x5FF5;&#xFF1A;<br>&#xFF08;1&#xFF09;&#x4EA7;&#x54C1;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x3002;&#x4EA7;&#x54C1;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x5373;&#x4EA7;&#x54C1;&#x7684;&#x7EE7;&#x627F;&#x7ED3;&#x6784;&#x3002;<br>&#xFF08;2&#xFF09;&#x4EA7;&#x54C1;&#x65CF;&#x3002;&#x5728;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4EA7;&#x54C1;&#x65CF;&#x662F;&#x6307;&#x7531;&#x540C;&#x4E00;&#x4E2A;&#x5DE5;&#x5382;&#x751F;&#x4EA7;&#x7684;&#xFF0C;&#x4F4D;&#x4E8E;&#x4E0D;&#x540C;&#x4EA7;&#x54C1;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x4E00;&#x7EC4;&#x4EA7;&#x54C1;&#x3002;<br>&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x4E0E;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x9488;&#x5BF9;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x7684;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#xFF0C;&#x800C;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x9700;&#x8981;&#x9762;&#x5BF9;&#x591A;&#x4E2A;&#x4EA7;&#x54C1;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#xFF0C;&#x4E00;&#x4E2A;&#x5DE5;&#x5382;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x8D1F;&#x8D23;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x4EA7;&#x54C1;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x4EA7;&#x54C1;&#x5BF9;&#x8C61;&#x7684;&#x521B;&#x5EFA;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x5DE5;&#x5382;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x51FA;&#x5206;&#x5C5E;&#x4E8E;&#x4E0D;&#x540C;&#x4EA7;&#x54C1;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x7684;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x65CF;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x6BD4;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x66F4;&#x4E3A;&#x7B80;&#x5355;&#x3001;&#x66F4;&#x6709;&#x6548;&#x7387;&#x3002;<br>&#x5B9A;&#x4E49;&#xFF1A;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF08;Abstract Factory Pattern&#xFF09;&#xFF1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x521B;&#x5EFA;&#x4E00;&#x7CFB;&#x5217;&#x76F8;&#x5173;&#x6216;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x65E0;&#x987B;&#x6307;&#x5B9A;&#x5B83;&#x4EEC;&#x5177;&#x4F53;&#x7684;&#x7C7B;&#x3002;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x53C8;&#x79F0;&#x4E3A;Kit&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;<strong>&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;</strong>&#x3002;<br>&#x5728;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;&#x56FE;&#x4E2D;&#x5305;&#x542B;&#x4EE5;&#x4E0B;4&#x4E2A;&#x89D2;&#x8272;&#xFF1A;<br>&#xFF08;1&#xFF09;AbstractFactory&#xFF08;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#xFF09;&#xFF1A;&#x5B83;&#x58F0;&#x660E;&#x4E86;&#x4E00;&#x7EC4;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x4E00;&#x65CF;&#x4EA7;&#x54C1;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5BF9;&#x5E94;&#x4E00;&#x79CD;&#x4EA7;&#x54C1;&#x3002;<br>&#xFF08;2&#xFF09;ConcreteFactory&#xFF08;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#xFF09;&#xFF1A;&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x5728;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x521B;&#x5EFA;&#x4EA7;&#x54C1;&#x989D;&#x65B9;&#x6CD5;&#xFF0C;&#x751F;&#x6210;&#x4E00;&#x7EC4;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EA7;&#x54C1;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x65CF;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x90FD;&#x4F4D;&#x4E8E;&#x67D0;&#x4E2A;&#x4EA7;&#x54C1;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x4E2D;&#x3002;<br>&#xFF08;3&#xFF09;Product&#xFF08;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#xFF09;&#xFF1A;&#x5B83;&#x4E3A;&#x6BCF;&#x79CD;&#x4EA7;&#x54C1;&#x58F0;&#x660E;&#x63A5;&#x53E3;&#xFF0C;&#x5728;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x4E2D;&#x58F0;&#x660E;&#x4E86;&#x4EA7;&#x54C1;&#x6240;&#x5177;&#x6709;&#x7684;&#x4E1A;&#x52A1;&#x65B9;&#x6CD5;&#x3002;<br>&#xFF08;4&#xFF09;ConcreteProduct&#xFF08;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#xFF09;&#xFF1A;&#x5B83;&#x5B9A;&#x4E49;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#x751F;&#x4EA7;&#x7684;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x5BF9;&#x8C61;&#xFF0C;&#x5B9E;&#x73B0;&#x5728;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x63A5;&#x53E3;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x4E1A;&#x52A1;&#x65B9;&#x6CD5;&#x3002;<br>&#x5728;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x4E2D;&#x58F0;&#x660E;&#x4E86;&#x591A;&#x4E2A;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x53EF;&#x4EE5;&#x662F;&#x63A5;&#x53E3;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x62BD;&#x8C61;&#x7C7B;&#x6216;&#x8005;&#x5177;&#x4F53;&#x7C7B;&#x3002;<br>&#x603B;&#x7ED3;&#xFF08;P85&#xFF09;</p>
<h4 id="&#x539F;&#x578B;&#x6A21;&#x5F0F;"><a href="#&#x539F;&#x578B;&#x6A21;&#x5F0F;" class="headerlink" title="&#x539F;&#x578B;&#x6A21;&#x5F0F;"></a><strong>&#x539F;&#x578B;&#x6A21;&#x5F0F;</strong></h4><p>&#x5BF9;&#x8C61;&#x7684;&#x514B;&#x9686;<br>&#x5728;&#x4F7F;&#x7528;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x9996;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x590D;&#x5236;&#x8FD9;&#x4E2A;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x6765;&#x521B;&#x5EFA;&#x66F4;&#x591A;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#x3002;<br>&#x5B9A;&#x4E49;&#xFF1A;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#xFF08;Prototype Pattern&#xFF09;&#xFF1A;&#x4F7F;&#x7528;&#x539F;&#x578B;&#x5B9E;&#x4F8B;&#x6307;&#x5B9A;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x79CD;&#x7C7B;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x514B;&#x9686;&#x8FD9;&#x4E9B;&#x539F;&#x578B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x79CD;<strong>&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;</strong>&#x3002;<br>&#x539F;&#x578B;&#x6A21;&#x5F0F;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x4F20;&#x7ED9;&#x90A3;&#x4E2A;&#x8981;&#x53D1;&#x52A8;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E2A;&#x8981;&#x53D1;&#x52A8;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x901A;&#x8FC7;&#x8BF7;&#x6C42;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x514B;&#x9686;&#x81EA;&#x5DF1;&#x6765;&#x5B9E;&#x73B0;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#x3002;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x79CD;&#x201C;&#x53E6;&#x7C7B;&#x201D;&#x7684;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;&#xFF0C;&#x521B;&#x5EFA;&#x514B;&#x9686;&#x5BF9;&#x8C61;&#x7684;&#x5DE5;&#x5382;&#x5C31;&#x662F;&#x539F;&#x578B;&#x7C7B;&#x81EA;&#x8EAB;&#xFF0C;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x7531;&#x514B;&#x9686;&#x65B9;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;&#x3002;<br>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x901A;&#x8FC7;&#x514B;&#x9686;&#x65B9;&#x6CD5;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5168;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x62E5;&#x6709;&#x65B0;&#x7684;&#x5730;&#x5740;&#x3002;<br>&#x5728;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;&#x56FE;&#x4E2D;&#x5305;&#x542B;&#x4EE5;&#x4E0B;3&#x4E2A;&#x89D2;&#x8272;&#xFF1A;<br>&#xFF08;1&#xFF09;Prototype&#xFF08;&#x62BD;&#x8C61;&#x539F;&#x578B;&#x7C7B;&#xFF09;&#xFF1A;&#x5B83;&#x662F;&#x58F0;&#x660E;&#x514B;&#x9686;&#x65B9;&#x6CD5;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x662F;&#x6240;&#x6709;&#x5177;&#x4F53;&#x539F;&#x578B;&#x7C7B;&#x7684;&#x516C;&#x5171;&#x7236;&#x7C7B;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x62BD;&#x8C61;&#x7C7B;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x63A5;&#x53E3;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x53EF;&#x4EE5;&#x662F;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x7C7B;&#x3002;<br>&#xFF08;2&#xFF09;ConcretePrototype&#xFF08;&#x5177;&#x4F53;&#x539F;&#x578B;&#x7C7B;&#xFF09;&#xFF1A;&#x5B83;&#x5B9E;&#x73B0;&#x5728;&#x62BD;&#x8C61;&#x539F;&#x578B;&#x7C7B;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x514B;&#x9686;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x514B;&#x9686;&#x65B9;&#x6CD5;&#x4E2D;&#x8FD4;&#x56DE;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E2A;&#x514B;&#x9686;&#x5BF9;&#x8C61;&#x3002;<br>&#xFF08;3&#xFF09;Client&#xFF08;&#x5BA2;&#x6237;&#x7C7B;&#xFF09;&#xFF1A;&#x8BA9;&#x4E00;&#x4E2A;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x514B;&#x9686;&#x81EA;&#x8EAB;&#x4ECE;&#x800C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5728;&#x5BA2;&#x6237;&#x7C7B;&#x4E2D;&#x53EA;&#x9700;&#x8981;&#x76F4;&#x63A5;&#x5B9E;&#x4F8B;&#x5316;&#x6216;&#x901A;&#x8FC7;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x7B49;&#x65B9;&#x5F0F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x514B;&#x9686;&#x65B9;&#x6CD5;&#x5373;&#x53EF;&#x5F97;&#x5230;&#x591A;&#x4E2A;&#x76F8;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x7531;&#x4E8E;&#x5BA2;&#x6237;&#x7C7B;&#x9488;&#x5BF9;&#x62BD;&#x8C61;&#x539F;&#x578B;&#x7C7B;Prototype&#x7F16;&#x7A0B;&#xFF0C;&#x56E0;&#x6B64;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x9009;&#x62E9;&#x5177;&#x4F53;&#x539F;&#x578B;&#x7C7B;&#xFF0C;&#x7CFB;&#x7EDF;&#x5177;&#x6709;&#x8F83;&#x597D;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x589E;&#x52A0;&#x6216;&#x66F4;&#x6362;&#x5177;&#x4F53;&#x539F;&#x578B;&#x7C7B;&#x90FD;&#x5F88;&#x65B9;&#x4FBF;&#x3002;<br>&#x5E38;&#x7528;&#x7684;&#x514B;&#x9686;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#xFF1A;<br>&#xFF08;1&#xFF09;&#x901A;&#x7528;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;<br>&#x901A;&#x7528;&#x7684;&#x514B;&#x9686;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x662F;&#x5728;&#x5177;&#x4F53;&#x539F;&#x578B;&#x7C7B;&#x7684;&#x514B;&#x9686;&#x65B9;&#x6CD5;&#x4E2D;&#x5B9E;&#x4F8B;&#x5316;&#x4E00;&#x4E2A;&#x4E0E;&#x81EA;&#x8EAB;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x5E76;&#x5C06;&#x5176;&#x8FD4;&#x56DE;&#xFF0C;&#x5E76;&#x5C06;&#x76F8;&#x5173;&#x7684;&#x53C2;&#x6570;&#x4F20;&#x5165;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x4FDD;&#x8BC1;&#x5B83;&#x4EEC;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x76F8;&#x540C;&#x3002;<br>class ConcretePrototype implements Prototype{<br>   private String attr;//&#x6210;&#x5458;&#x53D8;&#x91CF;<br>   public void setAttr(String attr){this.attr=attr;}<br>   public String getAttr(){return this.attr;}<br>   public Prototype clone(){<br>      Prototype prototype=new ConcretePrototype();//&#x521B;&#x5EFA;&#x65B0;&#x5BF9;&#x8C61;<br>      prototype.set(this.attr);<br>      return prototype;<br>   }<br>}<br>&#xFF08;2&#xFF09;Java&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x7684;clone()&#x65B9;&#x6CD5;<br>&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x514B;&#x9686;&#x7684;Java&#x7C7B;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x6807;&#x8BC6;&#x63A5;&#x53E3;Cloneable&#xFF0C;&#x8868;&#x793A;&#x8FD9;&#x4E2A;Java&#x7C7B;&#x652F;&#x6301;&#x88AB;&#x590D;&#x5236;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#x4F46;&#x662F;&#x8C03;&#x7528;&#x4E86;clone()&#x65B9;&#x6CD5;&#xFF0C;Java&#x7F16;&#x8BD1;&#x5668;&#x5C06;&#x629B;&#x51FA;&#x4E00;&#x4E2A;CloneNotSupportedException&#x5F02;&#x5E38;&#x3002;<br>class ConcretePrototype implements Cloneable{<br>   &#x2026;&#x2026;<br>   public Prototype clone(){<br>      Object object=null;<br>      try{object=super.clone();}<br>      catch(CloneNotSupportedException exception){<br>      }<br>      return (Prototype)object;<br>   }<br>}<br>&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x514B;&#x9686;&#x65B9;&#x6CD5;&#xFF1A;<br>1.&#x6D45;&#x514B;&#x9686;<br>&#x5728;&#x6D45;&#x514B;&#x9686;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x662F;&#x503C;&#x7C7B;&#x578B;&#xFF0C;&#x5C06;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x7ED9;&#x514B;&#x9686;&#x5BF9;&#x8C61;&#xFF1B;&#x5982;&#x679C;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x662F;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF0C;&#x5219;&#x5C06;&#x5F15;&#x7528;&#x5BF9;&#x8C61;&#x7684;&#x5730;&#x5740;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x7ED9;&#x514B;&#x9686;&#x5BF9;&#x8C61;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x548C;&#x514B;&#x9686;&#x5BF9;&#x8C61;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x6307;&#x5411;&#x76F8;&#x540C;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x6D45;&#x514B;&#x9686;&#x4E2D;&#xFF0C;&#x5F53;&#x5BF9;&#x8C61;&#x88AB;&#x590D;&#x5236;&#x65F6;&#x53EA;&#x590D;&#x5236;&#x5B83;&#x672C;&#x8EAB;&#x548C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x503C;&#x7C7B;&#x578B;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x6210;&#x5458;&#x5BF9;&#x8C61;&#x5E76;&#x6CA1;&#x6709;&#x88AB;&#x590D;&#x5236;&#x3002;<br>&#x5728;Java&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x8986;&#x76D6;Object&#x7C7B;&#x7684;clone()&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6D45;&#x514B;&#x9686;&#x3002;<br>2.&#x6DF1;&#x514B;&#x9686;<br>&#x5728;&#x6DF1;&#x514B;&#x9686;&#x4E2D;&#xFF0C;&#x65E0;&#x8BBA;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x662F;&#x503C;&#x7C7B;&#x578B;&#x8FD8;&#x662F;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF0C;&#x90FD;&#x5C06;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x7ED9;&#x514B;&#x9686;&#x5BF9;&#x8C61;&#xFF0C;&#x6DF1;&#x514B;&#x9686;&#x5C06;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x7684;&#x6240;&#x6709;&#x5F15;&#x7528;&#x5BF9;&#x8C61;&#x4E5F;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x7ED9;&#x514B;&#x9686;&#x5BF9;&#x8C61;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x6DF1;&#x514B;&#x9686;&#x4E2D;&#xFF0C;&#x9664;&#x4E86;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x88AB;&#x590D;&#x5236;&#x5916;&#xFF0C;&#x5BF9;&#x8C61;&#x6240;&#x5305;&#x542B;&#x7684;&#x6240;&#x6709;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x4E5F;&#x5C06;&#x88AB;&#x590D;&#x5236;&#x3002;<br>&#x5728;Java&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x6DF1;&#x514B;&#x9686;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5E8F;&#x5217;&#x5316;&#x7B49;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x3002;<br>&#x539F;&#x578B;&#x7BA1;&#x7406;&#x5668;&#xFF08;Prototype Manager&#xFF09;&#x662F;&#x5C06;&#x591A;&#x4E2A;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#x4E2D;&#x4F9B;&#x5BA2;&#x6237;&#x7AEF;&#x4F7F;&#x7528;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;<strong>&#x4E13;&#x95E8;&#x8D1F;&#x8D23;&#x514B;&#x9686;&#x5BF9;&#x8C61;&#x7684;&#x5DE5;&#x5382;</strong>&#xFF0C;&#x5176;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x67D0;&#x4E2A;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x4E2A;&#x514B;&#x9686;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x590D;&#x5236;&#x96C6;&#x5408;&#x4E2D;&#x5BF9;&#x5E94;&#x7684;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x6765;&#x83B7;&#x5F97;&#x3002;<br>&#x603B;&#x7ED3;&#xFF08;P103&#xFF09;</p>
<h4 id="&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;"><a href="#&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;" class="headerlink" title="&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;"></a><strong>&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;</strong></h4><p>&#x590D;&#x6742;&#x5BF9;&#x8C61;&#x7684;&#x7EC4;&#x88C5;&#x4E0E;&#x521B;&#x5EFA;<br>&#x52A8;&#x673A;&#xFF1A;&#x5982;&#x4F55;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x5730;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x7684;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#x3002;<br>&#x5B9A;&#x4E49;&#xFF1A;&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;&#xFF08;Builder Pattern&#xFF09;&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#x7684;&#x6784;&#x5EFA;&#x4E0E;&#x5B83;&#x7684;&#x8868;&#x793A;&#x5206;&#x79BB;&#xFF0C;&#x4F7F;&#x5F97;&#x540C;&#x6837;&#x7684;&#x6784;&#x5EFA;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x73B0;&#x3002;&#x5EFA;&#x9020;&#x8FD9;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x79CD;<strong>&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;</strong>&#x3002;<br>&#x5728;&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;&#x56FE;&#x4E2D;&#x5305;&#x542B;&#x4EE5;&#x4E0B;4&#x4E2A;&#x89D2;&#x8272;&#xFF1A;<br>&#xFF08;1&#xFF09;Builder&#xFF08;&#x62BD;&#x8C61;&#x5EFA;&#x9020;&#x8005;&#xFF09;&#xFF1A;&#x5B83;&#x4E3A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;Product&#x5BF9;&#x8C61;&#x7684;&#x5404;&#x4E2A;&#x90E8;&#x4EF6;&#x6307;&#x5B9A;&#x62BD;&#x8C61;&#x63A5;&#x53E3;&#xFF0C;&#x5728;&#x8BE5;&#x63A5;&#x53E3;&#x4E2D;&#x4E00;&#x822C;&#x58F0;&#x660E;&#x4E24;&#x7C7B;&#x65B9;&#x6CD5;&#xFF1A;&#x4E00;&#x7C7B;&#x65B9;&#x6CD5;&#x662F;buildPartX()&#xFF0C;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#x7684;&#x5404;&#x4E2A;&#x90E8;&#x4EF6;&#xFF1B;&#x53E6;&#x4E00;&#x7C7B;&#x65B9;&#x6CD5;&#x662F;getResult()&#xFF0C;&#x7528;&#x4E8E;&#x8FD4;&#x56DE;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#x3002;Builder&#x65E2;&#x53EF;&#x4EE5;&#x662F;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x63A5;&#x53E3;&#x3002;<br>&#xFF08;2&#xFF09;ConcreteBuilder&#xFF08;&#x5177;&#x4F53;&#x5EFA;&#x9020;&#x8005;&#xFF09;&#xFF1A;&#x5B83;&#x5B9E;&#x73B0;&#x4E86;Builder&#x63A5;&#x53E3;&#xFF0C;&#x5B9E;&#x73B0;&#x5404;&#x4E2A;&#x90E8;&#x4EF6;&#x7684;&#x5177;&#x4F53;&#x6784;&#x9020;&#x548C;&#x88C5;&#x914D;&#x65B9;&#x6CD5;&#xFF0C;&#x5B9A;&#x4E49;&#x5E76;&#x660E;&#x786E;&#x5176;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x521B;&#x5EFA;&#x597D;&#x7684;&#x590D;&#x6742;&#x4EA7;&#x54C1;&#x5BF9;&#x8C61;&#x3002;<br>&#xFF08;3&#xFF09;Product&#xFF08;&#x4EA7;&#x54C1;&#x89D2;&#x8272;&#xFF09;&#xFF1A;&#x5B83;&#x662F;&#x88AB;&#x6784;&#x5EFA;&#x7684;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#xFF0C;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x7EC4;&#x6210;&#x90E8;&#x4EF6;&#xFF0C;&#x5177;&#x4F53;&#x5EFA;&#x9020;&#x8005;&#x521B;&#x5EFA;&#x8BE5;&#x4EA7;&#x54C1;&#x7684;&#x5185;&#x90E8;&#x8868;&#x793A;&#x5E76;&#x5B9A;&#x4E49;&#x5176;&#x88C5;&#x914D;&#x8FC7;&#x7A0B;&#x3002;<br>&#xFF08;4&#xFF09;Director&#xFF08;&#x6307;&#x6325;&#x8005;&#xFF09;&#xFF1A;&#x6307;&#x6325;&#x8005;&#x53C8;&#x79F0;&#x4E3A;&#x5BFC;&#x6F14;&#x7C7B;&#xFF0C;&#x5B83;&#x8D1F;&#x8D23;&#x5B89;&#x6392;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#x7684;&#x5EFA;&#x9020;&#x6B21;&#x5E8F;&#xFF0C;&#x6307;&#x6325;&#x8005;&#x4E0E;&#x62BD;&#x8C61;&#x5EFA;&#x9020;&#x8005;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x5173;&#x8054;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5176;construct()&#x5EFA;&#x9020;&#x65B9;&#x6CD5;&#x4E2D;&#x8C03;&#x7528;&#x5EFA;&#x9020;&#x8005;&#x5BF9;&#x8C61;&#x7684;&#x90E8;&#x4EF6;&#x6784;&#x9020;&#x548C;&#x88C5;&#x914D;&#x65B9;&#x6CD5;&#xFF0C;&#x5B8C;&#x6210;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#x7684;&#x5EFA;&#x9020;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x4E00;&#x822C;&#x53EA;&#x9700;&#x8981;&#x4E0E;&#x6307;&#x6325;&#x8005;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x786E;&#x5B9A;&#x5177;&#x4F53;&#x5EFA;&#x9020;&#x8005;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5E76;&#x5B9E;&#x4F8B;&#x5316;&#x5177;&#x4F53;&#x5EFA;&#x9020;&#x8005;&#x5BF9;&#x8C61;&#xFF08;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x548C;&#x53CD;&#x5C04;&#x673A;&#x5236;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x6307;&#x6325;&#x8005;&#x7C7B;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6216;&#x8005;Setter&#x65B9;&#x6CD5;&#x5C06;&#x8BE5;&#x5BF9;&#x8C61;&#x4F20;&#x5165;&#x6307;&#x6325;&#x8005;&#x7C7B;&#x4E2D;&#x3002;<br>&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;&#x4E0E;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x6709;&#x70B9;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46;&#x662F;&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x590D;&#x6742;&#x4EA7;&#x54C1;&#xFF0C;&#x800C;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x8FD4;&#x56DE;&#x4E00;&#x7CFB;&#x5217;&#x76F8;&#x5173;&#x7684;&#x4EA7;&#x54C1;&#xFF1B;&#x5728;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x8FC7;&#x9009;&#x62E9;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#x6765;&#x751F;&#x6210;&#x6240;&#x9700;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x5728;&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x5177;&#x4F53;&#x5EFA;&#x9020;&#x8005;&#x7C7B;&#x578B;&#x5E76;&#x6307;&#x5BFC;Director&#x7C7B;&#x5982;&#x4F55;&#x53BB;&#x751F;&#x6210;&#x5BF9;&#x8C61;&#xFF0C;&#x4FA7;&#x91CD;&#x4E8E;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x5730;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x7ED3;&#x679C;&#x8FD4;&#x56DE;&#x3002;<br>&#x5173;&#x4E8E;Director&#x7684;&#x8FDB;&#x4E00;&#x6B65;&#x8BA8;&#x8BBA;<br>1.&#x7701;&#x7565;Director<br>2.&#x94A9;&#x5B50;&#x65B9;&#x6CD5;&#x7684;&#x5F15;&#x5165;<br>&#x603B;&#x7ED3;&#xFF08;P119&#xFF09;</p>
<h3 id="&#x7EC4;&#x5408;&#x7684;&#x827A;&#x672F;&#x2013;&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;"><a href="#&#x7EC4;&#x5408;&#x7684;&#x827A;&#x672F;&#x2013;&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;" class="headerlink" title="&#x7EC4;&#x5408;&#x7684;&#x827A;&#x672F;&#x2013;&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;"></a>&#x7EC4;&#x5408;&#x7684;&#x827A;&#x672F;&#x2013;&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;</h3><p>&#x6A21;&#x5F0F;&#x540D;&#x79F0;&#x548C;&#x5B9A;&#x4E49;<br><strong>&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x8F6C;&#x6362;&#x6210;&#x5BA2;&#x6237;&#x5E0C;&#x671B;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x4F7F;&#x63A5;&#x53E3;&#x4E0D;&#x517C;&#x5BB9;&#x7684;&#x90A3;&#x4E9B;&#x7C7B;&#x53EF;&#x4EE5;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x3002;<br><strong>&#x6865;&#x63A5;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5C06;&#x62BD;&#x8C61;&#x90E8;&#x5206;&#x4E0E;&#x5176;&#x5B9E;&#x73B0;&#x90E8;&#x5206;&#x5206;&#x79BB;&#xFF0C;&#x4F7F;&#x5B83;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x5730;&#x53D8;&#x5316;&#x3002;<br><strong>&#x7EC4;&#x5408;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x7EC4;&#x5408;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x5F62;&#x6210;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x4EE5;&#x8868;&#x793A;&#x5177;&#x6709;&#x201C;&#x6574;&#x4F53;-&#x90E8;&#x5206;&#x201D;&#x5173;&#x7CFB;&#x7684;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x3002;<br><strong>&#x88C5;&#x9970;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x52A8;&#x6001;&#x5730;&#x7ED9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x589E;&#x52A0;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x804C;&#x8D23;&#x3002;<br><strong>&#x5916;&#x89C2;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5916;&#x90E8;&#x4E0E;&#x4E00;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x901A;&#x4FE1;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x5916;&#x89C2;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#xFF0C;&#x4E3A;&#x5B50;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E00;&#x7EC4;&#x63A5;&#x53E3;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x4E00;&#x81F4;&#x7684;&#x5165;&#x53E3;&#x3002;<br><strong>&#x4EAB;&#x5143;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x8FD0;&#x7528;&#x5171;&#x4EAB;&#x6280;&#x672F;&#x6709;&#x6548;&#x5730;&#x652F;&#x6301;&#x5927;&#x91CF;&#x7EC6;&#x7C92;&#x5EA6;&#x5BF9;&#x8C61;&#x7684;&#x590D;&#x7528;&#x3002;<br><strong>&#x4EE3;&#x7406;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x7ED9;&#x67D0;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x4EE3;&#x7406;&#xFF0C;&#x5E76;&#x7531;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x63A7;&#x5236;&#x5BF9;&#x539F;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x3002;</p>
<h4 id="&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#xFF1A;"><a href="#&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#xFF1A;" class="headerlink" title="&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#xFF1A;"></a><strong>&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;</strong>&#xFF1A;</h4><p>&#x4E0D;&#x517C;&#x5BB9;&#x7ED3;&#x6784;&#x7684;&#x534F;&#x8C03;<br>&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x63A5;&#x53E3;&#x548C;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x63A5;&#x53E3;&#x5339;&#x914D;&#x8D77;&#x6765;&#xFF0C;&#x800C;&#x65E0;&#x987B;&#x4FEE;&#x6539;&#x539F;&#x6765;&#x7684;&#x9002;&#x914D;&#x8005;&#x63A5;&#x53E3;&#x548C;&#x62BD;&#x8C61;&#x76EE;&#x6807;&#x63A5;&#x53E3;&#x3002;<br>&#x5B9A;&#x4E49;&#xFF1A;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#xFF08;Adapter Pattern&#xFF09;&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x8F6C;&#x6362;&#x6210;&#x5BA2;&#x6237;&#x5E0C;&#x671B;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x4F7F;&#x63A5;&#x53E3;&#x4E0D;&#x517C;&#x5BB9;&#x7684;&#x90A3;&#x4E9B;&#x7C7B;&#x53EF;&#x4EE5;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#xFF0C;&#x5176;&#x522B;&#x540D;&#x4E3A;&#x5305;&#x88C5;&#x7C7B;&#xFF08;Wrapper&#xFF09;&#x3002;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x65E2;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x7C7B;&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;&#x3002;<br>&#x5728;<strong>&#x5BF9;&#x8C61;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;</strong>&#x4E2D;&#xFF0C;&#x9002;&#x914D;&#x5668;&#x4E0E;&#x9002;&#x914D;&#x8005;&#x4E4B;&#x95F4;&#x662F;&#x5173;&#x8054;&#x5173;&#x7CFB;&#xFF1B;&#x5728;<strong>&#x7C7B;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;</strong>&#x4E2D;&#xFF0C;&#x9002;&#x914D;&#x5668;&#x4E0E;&#x9002;&#x914D;&#x8005;&#x4E4B;&#x95F4;&#x662F;&#x7EE7;&#x627F;&#xFF08;&#x6216;&#x5B9E;&#x73B0;&#xFF09;&#x5173;&#x7CFB;&#x3002;<br>&#x5728;&#x5BF9;&#x8C61;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;&#x4E2D;&#x5305;&#x542B;&#x4EE5;&#x4E0B;3&#x4E2A;&#x89D2;&#x8272;&#xFF1A;<br>&#xFF08;1&#xFF09;Target&#xFF08;&#x76EE;&#x6807;&#x62BD;&#x8C61;&#x7C7B;&#xFF09;&#xFF1A;&#x76EE;&#x6807;&#x62BD;&#x8C61;&#x7C7B;&#x5B9A;&#x4E49;&#x5BA2;&#x6237;&#x6240;&#x9700;&#x63A5;&#x53E3;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x7C7B;&#x6216;&#x63A5;&#x53E3;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5177;&#x4F53;&#x7C7B;&#x3002;<br>&#xFF08;2&#xFF09;Adapter&#xFF08;&#x9002;&#x914D;&#x5668;&#x7C7B;&#xFF09;&#xFF1A;&#x9002;&#x914D;&#x5668;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x9002;&#x914D;&#x5668;&#xFF0C;&#x5BF9;Adaptee&#x548C;Target&#x8FDB;&#x884C;&#x9002;&#x914D;&#x3002;&#x9002;&#x914D;&#x5668;&#x7C7B;&#x662F;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x5728;&#x5BF9;&#x8C61;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x7EE7;&#x627F;Target&#x5E76;&#x5173;&#x8054;&#x4E00;&#x4E2A;Adaptee&#x5BF9;&#x8C61;&#x4F7F;&#x4E8C;&#x8005;&#x4EA7;&#x751F;&#x8054;&#x7CFB;&#x3002;<br>&#xFF08;3&#xFF09;Adaptee&#xFF08;&#x9002;&#x914D;&#x8005;&#x7C7B;&#xFF09;&#xFF1A;&#x9002;&#x914D;&#x8005;&#x5373;&#x88AB;&#x9002;&#x914D;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#x9700;&#x8981;&#x9002;&#x914D;&#xFF0C;&#x9002;&#x914D;&#x8005;&#x7C7B;&#x4E00;&#x822C;&#x662F;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7C7B;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x5BA2;&#x6237;&#x5E0C;&#x671B;&#x4F7F;&#x7528;&#x7684;&#x4E1A;&#x52A1;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x9002;&#x914D;&#x8005;&#x7C7B;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x3002;<br>&#x5178;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;<br>class Adapter extends Target{<br>   private Adaptee adaptee;<br>   public Adapter(Adaptee adaptee){this.adaptee=adaptee;}<br>   public void request(){adaptee.specificRequest();}<br>}<br>&#x7C7B;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x4E0E;&#x5BF9;&#x8C61;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x5176;&#x9002;&#x914D;&#x5668;&#x548C;&#x9002;&#x914D;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x662F;<strong>&#x7EE7;&#x627F;&#x5173;&#x7CFB;</strong>&#x3002;<br>&#x5728;&#x5BF9;&#x8C61;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x9002;&#x914D;&#x5668;&#x4E2D;&#x540C;&#x65F6;&#x5305;&#x542B;&#x5BF9;&#x76EE;&#x6807;&#x7C7B;&#x548C;&#x9002;&#x914D;&#x7C7B;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x9002;&#x914D;&#x8005;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B83;&#x8C03;&#x7528;&#x76EE;&#x6807;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x76EE;&#x6807;&#x7C7B;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B83;&#x8C03;&#x7528;&#x9002;&#x914D;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x9002;&#x914D;&#x5668;&#x5C31;&#x662F;&#x4E00;&#x4E2A;<strong>&#x53CC;&#x5411;&#x9002;&#x914D;&#x5668;</strong>&#x3002;</p>
<h3 id="&#x4EA4;&#x4E92;&#x7684;&#x827A;&#x672F;&#x2013;&#x884C;&#x4E3A;&#x578B;&#x6A21;&#x5F0F;"><a href="#&#x4EA4;&#x4E92;&#x7684;&#x827A;&#x672F;&#x2013;&#x884C;&#x4E3A;&#x578B;&#x6A21;&#x5F0F;" class="headerlink" title="&#x4EA4;&#x4E92;&#x7684;&#x827A;&#x672F;&#x2013;&#x884C;&#x4E3A;&#x578B;&#x6A21;&#x5F0F;"></a>&#x4EA4;&#x4E92;&#x7684;&#x827A;&#x672F;&#x2013;&#x884C;&#x4E3A;&#x578B;&#x6A21;&#x5F0F;</h3><p><strong>&#x804C;&#x8D23;&#x94FE;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x907F;&#x514D;&#x5C06;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x8005;&#x4E0E;&#x63A5;&#x6536;&#x8005;&#x8026;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x8BA9;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x6709;&#x673A;&#x4F1A;&#x63A5;&#x6536;&#x8BF7;&#x6C42;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x8FDE;&#x63A5;&#x6210;&#x4E00;&#x6761;&#x94FE;&#xFF0C;&#x5E76;&#x4E14;&#x6CBF;&#x7740;&#x8FD9;&#x6761;&#x94FE;&#x4F20;&#x9012;&#x8BF7;&#x6C42;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x5BF9;&#x8C61;&#x5904;&#x7406;&#x5B83;&#x4E3A;&#x6B62;&#x3002;<br><strong>&#x547D;&#x4EE4;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x5C01;&#x88C5;&#x4E3A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x8BF7;&#x6C42;&#x5BF9;&#x5BA2;&#x6237;&#x8FDB;&#x884C;&#x53C2;&#x6570;&#x5316;&#xFF1B;&#x5BF9;&#x8BF7;&#x6C42;&#x6392;&#x961F;&#x6216;&#x8005;&#x8BB0;&#x5F55;&#x8BF7;&#x6C42;&#x65E5;&#x5FD7;&#xFF0C;&#x4EE5;&#x53CA;&#x652F;&#x6301;&#x53EF;&#x64A4;&#x9500;&#x7684;&#x64CD;&#x4F5C;&#x3002;<br><strong>&#x89E3;&#x91CA;&#x5668;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x7684;&#x6587;&#x6CD5;&#xFF0C;&#x5E76;&#x4E14;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x6765;&#x89E3;&#x91CA;&#x8BE5;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x53E5;&#x5B50;&#x3002;<br><strong>&#x8FED;&#x4EE3;&#x5668;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x8BBF;&#x95EE;&#x805A;&#x5408;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x66B4;&#x9732;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x90E8;&#x8868;&#x793A;&#x3002;<br><strong>&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x7528;&#x4E00;&#x4E2A;&#x4E2D;&#x4ECB;&#x5BF9;&#x8C61;&#xFF08;&#x4E2D;&#x4ECB;&#x8005;&#xFF09;&#x6765;&#x5C01;&#x88C5;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x5BF9;&#x8C61;&#x4EA4;&#x4E92;&#xFF0C;&#x4E2D;&#x4ECB;&#x8005;&#x4F7F;&#x5404;&#x5BF9;&#x8C61;&#x4E0D;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x5730;&#x76F8;&#x4E92;&#x5F15;&#x7528;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5176;&#x8026;&#x5408;&#x677E;&#x6563;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x5730;&#x6539;&#x53D8;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x3002;<br><strong>&#x5907;&#x5FD8;&#x5F55;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5728;&#x4E0D;&#x7834;&#x574F;&#x5C01;&#x88C5;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x6355;&#x83B7;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x90E8;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x5728;&#x8BE5;&#x5BF9;&#x8C61;&#x4E4B;&#x5916;&#x4FDD;&#x5B58;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5728;&#x4EE5;&#x540E;&#x5C06;&#x5BF9;&#x8C61;&#x6062;&#x590D;&#x5230;&#x539F;&#x5148;&#x4FDD;&#x5B58;&#x7684;&#x72B6;&#x6001;&#x3002;<br><strong>&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5B9A;&#x4E49;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x79CD;&#x4E00;&#x5BF9;&#x591A;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x4F7F;&#x5F97;&#x6BCF;&#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x72B6;&#x6001;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x65F6;&#xFF0C;&#x5176;&#x76F8;&#x5173;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#x7686;&#x5F97;&#x5230;&#x901A;&#x77E5;&#x5E76;&#x88AB;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x3002;<br><strong>&#x72B6;&#x6001;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5728;&#x5176;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x6539;&#x53D8;&#x65F6;&#x6539;&#x53D8;&#x5B83;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x5BF9;&#x8C61;&#x770B;&#x8D77;&#x6765;&#x4F3C;&#x4E4E;&#x4FEE;&#x6539;&#x4E86;&#x5B83;&#x7684;&#x7C7B;&#x3002;<br><strong>&#x7B56;&#x7565;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5B9A;&#x4E49;&#x4E00;&#x7CFB;&#x5217;&#x7B97;&#x6CD5;&#x7C7B;&#xFF0C;&#x5C06;&#x6BCF;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x5C01;&#x88C5;&#x8D77;&#x6765;&#xFF0C;&#x5E76;&#x8BA9;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x76F8;&#x4E92;&#x66FF;&#x6362;&#xFF0C;&#x4F7F;&#x5F97;&#x7B97;&#x6CD5;&#x7684;&#x53D8;&#x5316;&#x53EF;&#x72EC;&#x7ACB;&#x4E8E;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x5BA2;&#x6237;&#x3002;<br><strong>&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x4E2D;&#x7B97;&#x6CD5;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x800C;&#x5C06;&#x4E00;&#x4E9B;&#x6B65;&#x9AA4;&#x5EF6;&#x8FDF;&#x5230;&#x5B50;&#x7C7B;&#x4E2D;&#xFF0C;&#x4F7F;&#x5F97;&#x5B50;&#x7C7B;&#x53EF;&#x4EE5;&#x4E0D;&#x6539;&#x53D8;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x7ED3;&#x6784;&#x5373;&#x53EF;&#x91CD;&#x5B9A;&#x4E49;&#x8BE5;&#x7B97;&#x6CD5;&#x7684;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x6B65;&#x9AA4;&#x3002;<br><strong>&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x4F5C;&#x7528;&#x4E8E;&#x67D0;&#x5BF9;&#x8C61;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x5404;&#x5143;&#x7D20;&#x7684;&#x64CD;&#x4F5C;&#x8868;&#x793A;&#xFF0C;&#x4F7F;&#x5F97;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x6539;&#x53D8;&#x5404;&#x5143;&#x7D20;&#x7684;&#x7C7B;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x5B9A;&#x4E49;&#x4F5C;&#x7528;&#x4E8E;&#x8FD9;&#x4E9B;&#x5143;&#x7D20;&#x7684;&#x65B0;&#x64CD;&#x4F5C;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/设计模式/" rel="tag">#设计模式</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/01/Log4j使用简记/" rel="next" title="Log4j使用简记">
                <i class="fa fa-chevron-left"></i> Log4j使用简记
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          

  <p>热评文章</p>
  <div class="ds-top-threads" data-range="weekly" data-num-items="4"></div>


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/09/13/《设计模式的艺术-软件开发人员内功修炼之道》简记/"
           data-title="《设计模式的艺术:软件开发人员内功修炼之道》简记" data-url="http://tedhacker.top/2016/09/13/《设计模式的艺术-软件开发人员内功修炼之道》简记/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.jpg"
               alt="TedHacker" />
          <p class="site-author-name" itemprop="name">TedHacker</p>
          <p class="site-description motion-element" itemprop="description">一步一步慢慢往上爬~ (ง •̀_•́)ง</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">14</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">7</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">16</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/TedHacker" target="_blank" title="Github">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  Github
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.csdn.net/acm_Ted" target="_blank" title="CSDN">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  CSDN
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#7种常用的面向对象设计原则"><span class="nav-number">1.</span> <span class="nav-text">7种常用的面向对象设计原则</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#创建的艺术–创建型模式"><span class="nav-number">2.</span> <span class="nav-text">创建的艺术–创建型模式</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#单例模式："><span class="nav-number">2.1.</span> <span class="nav-text">单例模式：</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#简单工厂模式："><span class="nav-number">2.2.</span> <span class="nav-text">简单工厂模式：</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#工厂方法模式"><span class="nav-number">2.3.</span> <span class="nav-text">工厂方法模式</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#抽象工厂模式"><span class="nav-number">2.4.</span> <span class="nav-text">抽象工厂模式</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#原型模式"><span class="nav-number">2.5.</span> <span class="nav-text">原型模式</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#建造者模式"><span class="nav-number">2.6.</span> <span class="nav-text">建造者模式</span></a></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#组合的艺术–结构型模式"><span class="nav-number">3.</span> <span class="nav-text">组合的艺术–结构型模式</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#适配器模式："><span class="nav-number">3.1.</span> <span class="nav-text">适配器模式：</span></a></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#交互的艺术–行为型模式"><span class="nav-number">4.</span> <span class="nav-text">交互的艺术–行为型模式</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">TedHacker</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>


        

<div class="busuanzi-count">

  <script async src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js"></script>

  

  
    <span class="site-pv">Total visited<span class="busuanzi-value" id="busuanzi_value_site_pv"></span>times.</span>
  
  
</div>



        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"tedhacker"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/vendors/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = true;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '' && data_content != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title < 0 && index_content < 0 ){
                                isMatch = false;
                            } else {
                                if (index_content < 0) {
                                    index_content = 0;
                                }
                                if (i == 0) {
                                    first_occur = index_content;
                                }
                            }
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });

                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  
  <script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
  </script>

  <script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
      var all = MathJax.Hub.getAllJax(), i;
      for (i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
      }
    });
  </script>
  <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>


  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("pTAH4gqlpIJiGEiOdiEPaubQ-gzGzoHsz", "mqmc64oerUohcXqxQxrDJwjt");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
          for(var i = 0; i < entries.length; i++) {
            var url = entries[i];
            var element = document.getElementById(url);
            var countSpan = $(element).find(COUNT_CONTAINER_REF);
            if( countSpan.text() == '') {
              countSpan.text(0);
            }
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            /* Set ACL */
            var acl = new AV.ACL();
            acl.setPublicReadAccess(true);
            acl.setPublicWriteAccess(true);
            newcounter.setACL(acl);
            /* End Set ACL */
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>



  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


</body>
</html>
